/*
Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),// результат помістіть у змінну v
*/

const Pi = 3.14;
let heightC = 10;
let dC = 4;

let result = heightC * ((Pi * dC) / 4);
console.log("Об'єм циліндра = ", result);

/*
У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
*/

let n = 3;
let m = 4;
let c = Math.pow((Math.pow(n, 2) + Math.pow(m, 2)), 0.5);
console.log("Гіпотенуза = ", c);